
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       42 |          14 |           30 |
## Affected resources by action

|  Action  | Resources                                                                                                       |
|:--------:|:----------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.module.deregistration.aws_cloudwatch_event_rule.scale`                                   |
|    🟢    | `module.actions-runner.module.deregistration.aws_cloudwatch_event_target.scale-in-out`                          |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess`       |
|    🟢    | `module.actions-runner.module.deregistration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook`         |
|    🟢    | `module.actions-runner.module.instance-profile.aws_iam_role_policy_attachment.extra["ssm"]`                     |
|    🟢    | `module.actions-runner.module.registration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess`         |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_rule.scale`                             |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_target.scale-in-out`                    |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess` |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook`   |
|    🟢    | `module.actions-runner-noble.module.instance-profile.aws_iam_role_policy_attachment.extra["ssm"]`               |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess`   |
|    🟡    | `module.actions-runner.aws_autoscaling_group.actions-runner`                                                    |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`                                              |
|    🟡    | `module.actions-runner.module.deregistration.aws_iam_policy.lambda_permissions`                                 |
|    🟡    | `module.actions-runner.module.deregistration.aws_lambda_function.lambda`                                        |
|    🟡    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every`                                |
|    🟡    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target`                          |
|    🟡    | `module.actions-runner.module.registration.aws_iam_policy.lambda_permissions`                                   |
|    🟡    | `module.actions-runner.module.registration.aws_lambda_function.main`                                            |
|    🟡    | `module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_permissions`                           |
|    🟡    | `module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda`                                  |
|    🟡    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every`                          |
|    🟡    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target`                    |
|    🟡    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions`                             |
|    🟡    | `module.actions-runner-noble.module.registration.aws_lambda_function.main`                                      |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250505203133108100000007-INx3ry"
        name                             = "actions-runner-20250505203133108100000007-INx3ry"
      ~ vpc_zone_identifier              = [
          - "subnet-004bd6d011ea52557",
          - "subnet-0dbff142ba4620c5f",
          + "subnet-0a205209260302668",
          + "subnet-0a3a8e5a973c88986",
        ]
      ~ wait_for_capacity_timeout        = "10m" -> "15m"
        # (29 unchanged attributes hidden)

        # (13 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250505203133193000000009-KWX4No"
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
      ~ vpc_zone_identifier              = [
          - "subnet-004bd6d011ea52557",
          - "subnet-0dbff142ba4620c5f",
          + "subnet-0a205209260302668",
          + "subnet-0a3a8e5a973c88986",
        ]
      ~ wait_for_capacity_timeout        = "10m" -> "15m"
        # (29 unchanged attributes hidden)

        # (13 unchanged blocks hidden)
    }

  # module.actions-runner.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.deregistration.aws_cloudwatch_event_rule.scale will be created
  + resource "aws_cloudwatch_event_rule" "scale" {
      + arn            = (known after apply)
      + description    = "ASG lifecycle hook"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + AutoScalingGroupName = [
                      + "actions-runner-20250505203133108100000007-INx3ry",
                    ]
                }
              + detail-type = [
                  + "EC2 Instance-terminate Lifecycle Action",
                ]
              + source      = [
                  + "aws.autoscaling",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "actions-runner-20250505203133108100000"
      + tags           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.deregistration.aws_cloudwatch_event_target.scale-in-out will be created
  + resource "aws_cloudwatch_event_target" "scale-in-out" {
      + arn            = "arn:aws:lambda:us-west-1:303467602807:function:actions-runner-20250505203133108100000007-INx3ry_deregistration"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id               = "arn:aws:iam::303467602807:policy/lambda_permissions2025050520313903850000000c"
        name             = "lambda_permissions2025050520313903850000000c"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "sts:GetCallerIdentity",
                            "autoscaling:CompleteLifecycleAction",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssm:SendCommand",
                          + "ssm:GetCommandInvocation",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                    {
                        Action   = [
                            "autoscaling:DescribeWarmPool",
                            "autoscaling:DescribeAutoScalingInstances",
                            "autoscaling:DescribeAutoScalingGroups",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaENIManagementAccess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess"
      + role       = "infrahouse-registration2025050520313905020000000d"
    }

  # module.actions-runner.module.deregistration.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_deregistration"
      ~ last_modified                  = "2025-05-05T20:31:47.837+0000" -> (known after apply)
      ~ s3_key                         = "763f2111-1262-f9be-c51a-930474a5e570.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "HOOK_NAME"                        = "deregistration" -> null
                # (6 unchanged elements hidden)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0fd56f0a993a8ce74",
            ]
          + subnet_ids                  = [
              + "subnet-0a205209260302668",
              + "subnet-0a3a8e5a973c88986",
            ]
        }

        # (3 unchanged blocks hidden)
    }

  # module.actions-runner.module.deregistration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "actions-runner-20250505203133108100000007-INx3ry_deregistration"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/763f2111-1262-f9be-c51a-930474a5e570.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "e7e28affeca02e29a594bcbdb99292b6-5" -> (known after apply)
      ~ id                            = "763f2111-1262-f9be-c51a-930474a5e570.zip" -> (known after apply)
      ~ key                           = "763f2111-1262-f9be-c51a-930474a5e570.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/runner_deregistration/763f2111-1262-f9be-c51a-930474a5e570.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.deregistration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "2510705551645762660" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744" -> "c9bc5cebad6b81307c300f8d1e09723a"
          ~ "main_version"         = "0ca4a122c64f37b43518510e62641af2" -> "0610829c0e634ca072d657f4557e894f"
        }
    }

  # module.actions-runner.module.deregistration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "763f2111-1262-f9be-c51a-930474a5e570" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "0ca4a122c64f37b43518510e62641af2" -> "0610829c0e634ca072d657f4557e894f"
          ~ "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744" -> "c9bc5cebad6b81307c300f8d1e09723a"
        }
      ~ result  = "763f2111-1262-f9be-c51a-930474a5e570" -> (known after apply)
    }

  # module.actions-runner.module.instance-profile.aws_iam_role_policy_attachment.extra["ssm"] will be created
  + resource "aws_iam_role_policy_attachment" "extra" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "actions-runner-oracular"
    }

  # module.actions-runner.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "run_every" {
      ~ description         = "Trigger Lambda record_metric_actions-runner-20250505203133108100000007-INx3ry every minute" -> "Trigger Lambda actions-runner-20250505203133108100000007-INx3ry_record_metric every minute"
        id                  = "actions-runner-2025050520313310810000020250505215106284300000001"
        name                = "actions-runner-2025050520313310810000020250505215106284300000001"
        tags                = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "lambda_target" {
      ~ arn            = "arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133108100000007-INx3ry" -> (known after apply)
        id             = "actions-runner-2025050520313310810000020250505215106284300000001-send-to-lambda"
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_log_group.lambda must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda" {
      ~ arn               = "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/record_metric_actions-runner-20250505203133108100000007-INx3ry" -> (known after apply)
      ~ id                = "/aws/lambda/record_metric_actions-runner-20250505203133108100000007-INx3ry" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/record_metric_actions-runner-20250505203133108100000007-INx3ry" -> "/aws/lambda/actions-runner-20250505203133108100000007-INx3ry_record_metric" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (4 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_iam_policy.lambda_logging must be replaced
-/+ resource "aws_iam_policy" "lambda_logging" {
      ~ arn              = "arn:aws:iam::303467602807:policy/lambda_logging20250505215106741000000004" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "IAM policy for logging from a lambda record_metric_actions-runner-20250505203133108100000007-INx3ry" -> "IAM policy for logging from a lambda actions-runner-20250505203133108100000007-INx3ry_record_metric" # forces replacement
      ~ id               = "arn:aws:iam::303467602807:policy/lambda_logging20250505215106741000000004" -> (known after apply)
      ~ name             = "lambda_logging20250505215106741000000004" -> (known after apply)
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogStream"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/record_metric_actions-runner-20250505203133108100000007-INx3ry"
                    },
                  - {
                      - Action   = "logs:PutLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id        = "ANPAUNKAUEN36RTDZEICH" -> (known after apply)
        tags             = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (3 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_logs" {
      ~ id         = "infrahouse-registration20250505214430567900000006-20250505215107809500000005" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::303467602807:policy/lambda_logging20250505215106741000000004" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda must be replaced
-/+ resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133108100000007-INx3ry" -> (known after apply)
      ~ code_sha256                    = "NirQYUBJ+B+ARjYXfiNyG6yjiOEhK/71smAF7XEVapg=" -> (known after apply)
      ~ function_name                  = "record_metric_actions-runner-20250505203133108100000007-INx3ry" -> "actions-runner-20250505203133108100000007-INx3ry_record_metric" # forces replacement
      ~ id                             = "record_metric_actions-runner-20250505203133108100000007-INx3ry" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133108100000007-INx3ry/invocations" -> (known after apply)
      ~ last_modified                  = "2025-05-05T22:40:04.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133108100000007-INx3ry:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133108100000007-INx3ry:$LATEST/invocations" -> (known after apply)
      ~ s3_key                         = "625b5b32-b451-fee9-fb8b-4f0728ba4077.zip" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 21151336 -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/record_metric_actions-runner-20250505203133108100000007-INx3ry" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function_event_invoke_config.update_filter must be replaced
-/+ resource "aws_lambda_function_event_invoke_config" "update_filter" {
      ~ function_name                = "record_metric_actions-runner-20250505203133108100000007-INx3ry" -> "actions-runner-20250505203133108100000007-INx3ry_record_metric" # forces replacement
      ~ id                           = "record_metric_actions-runner-20250505203133108100000007-INx3ry" -> (known after apply)
      - maximum_event_age_in_seconds = 0 -> null
        # (2 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge must be replaced
-/+ resource "aws_lambda_permission" "allow_eventbridge" {
      ~ function_name       = "record_metric_actions-runner-20250505203133108100000007-INx3ry" -> "actions-runner-20250505203133108100000007-INx3ry_record_metric" # forces replacement
      ~ id                  = "AllowExecutionFromEventBridge" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/625b5b32-b451-fee9-fb8b-4f0728ba4077.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "173fac6498ed570a6ab452a2c8a6e985-5" -> (known after apply)
      ~ id                            = "625b5b32-b451-fee9-fb8b-4f0728ba4077.zip" -> (known after apply)
      ~ key                           = "625b5b32-b451-fee9-fb8b-4f0728ba4077.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/record_metric/625b5b32-b451-fee9-fb8b-4f0728ba4077.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "6588613890413404012" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744" -> "b27996808eca928c3e27d41ab0ab456d"
          ~ "main_version"         = "38c7850f0e812a275d4d5235aa4bd045" -> "009a1509fd6c7174d1f87bf6bac70353"
        }
    }

  # module.actions-runner.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "625b5b32-b451-fee9-fb8b-4f0728ba4077" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "38c7850f0e812a275d4d5235aa4bd045" -> "009a1509fd6c7174d1f87bf6bac70353"
          ~ "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744" -> "b27996808eca928c3e27d41ab0ab456d"
        }
      ~ result  = "625b5b32-b451-fee9-fb8b-4f0728ba4077" -> (known after apply)
    }

  # module.actions-runner.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.registration.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id               = "arn:aws:iam::303467602807:policy/lambda_permissions20250505203139459600000013"
        name             = "lambda_permissions20250505203139459600000013"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "autoscaling:RecordLifecycleActionHeartbeat",
                            "autoscaling:CompleteLifecycleAction",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:*:autoScalingGroupName/actions-runner-20250505203133108100000007-INx3ry"
                    },
                  ~ {
                      ~ Action   = [
                          + "ssm:SendCommand",
                          + "ssm:GetCommandInvocation",
                            "ec2:DescribeTags",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "ec2:CreateTags"
                        Effect   = "Allow"
                        Resource = "arn:aws:ec2:*:303467602807:instance/*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaENIManagementAccess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess"
      + role       = "infrahouse-registration2025050520313903630000000b"
    }

  # module.actions-runner.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_registration"
      ~ last_modified                  = "2025-05-05T20:31:52.955+0000" -> (known after apply)
      ~ s3_key                         = "26054ad6-84d9-2615-e522-31c5dbf1e8e9.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0fd56f0a993a8ce74",
            ]
          + subnet_ids                  = [
              + "subnet-0a205209260302668",
              + "subnet-0a3a8e5a973c88986",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/26054ad6-84d9-2615-e522-31c5dbf1e8e9.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "18a298cb09ac16452bc89360cd7d98ee-5" -> (known after apply)
      ~ id                            = "26054ad6-84d9-2615-e522-31c5dbf1e8e9.zip" -> (known after apply)
      ~ key                           = "26054ad6-84d9-2615-e522-31c5dbf1e8e9.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/runner_registration/26054ad6-84d9-2615-e522-31c5dbf1e8e9.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "997816847620898665" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744" -> "c9bc5cebad6b81307c300f8d1e09723a"
          ~ "main_version"         = "95d3cdd170c6143cae4d84604cb4c6e9" -> "f9ec518ccebbfddf2a90c8883410c99b"
        }
    }

  # module.actions-runner.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "26054ad6-84d9-2615-e522-31c5dbf1e8e9" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "95d3cdd170c6143cae4d84604cb4c6e9" -> "f9ec518ccebbfddf2a90c8883410c99b"
          ~ "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744" -> "c9bc5cebad6b81307c300f8d1e09723a"
        }
      ~ result  = "26054ad6-84d9-2615-e522-31c5dbf1e8e9" -> (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_rule.scale will be created
  + resource "aws_cloudwatch_event_rule" "scale" {
      + arn            = (known after apply)
      + description    = "ASG lifecycle hook"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + AutoScalingGroupName = [
                      + "actions-runner-20250505203133193000000009-KWX4No",
                    ]
                }
              + detail-type = [
                  + "EC2 Instance-terminate Lifecycle Action",
                ]
              + source      = [
                  + "aws.autoscaling",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "actions-runner-20250505203133193000000"
      + tags           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_target.scale-in-out will be created
  + resource "aws_cloudwatch_event_target" "scale-in-out" {
      + arn            = "arn:aws:lambda:us-west-1:303467602807:function:actions-runner-20250505203133193000000009-KWX4No_deregistration"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id               = "arn:aws:iam::303467602807:policy/lambda_permissions20250505203139610200000016"
        name             = "lambda_permissions20250505203139610200000016"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "sts:GetCallerIdentity",
                            "autoscaling:CompleteLifecycleAction",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssm:SendCommand",
                          + "ssm:GetCommandInvocation",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                    {
                        Action   = [
                            "autoscaling:DescribeWarmPool",
                            "autoscaling:DescribeAutoScalingInstances",
                            "autoscaling:DescribeAutoScalingGroups",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaENIManagementAccess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess"
      + role       = "infrahouse-registration20250505203139650800000017"
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_deregistration"
      ~ last_modified                  = "2025-05-05T20:31:47.742+0000" -> (known after apply)
      ~ s3_key                         = "157ef5f2-a6b2-80e9-c896-5535053f52d1.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "HOOK_NAME"                        = "deregistration" -> null
                # (6 unchanged elements hidden)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0bb31d7e35bcabcab",
            ]
          + subnet_ids                  = [
              + "subnet-0a205209260302668",
              + "subnet-0a3a8e5a973c88986",
            ]
        }

        # (3 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "actions-runner-20250505203133193000000009-KWX4No_deregistration"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/157ef5f2-a6b2-80e9-c896-5535053f52d1.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "cd534842f6aa7272b908e82fc508fae7-5" -> (known after apply)
      ~ id                            = "157ef5f2-a6b2-80e9-c896-5535053f52d1.zip" -> (known after apply)
      ~ key                           = "157ef5f2-a6b2-80e9-c896-5535053f52d1.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/157ef5f2-a6b2-80e9-c896-5535053f52d1.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.deregistration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "9015891930812048991" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744" -> "c9bc5cebad6b81307c300f8d1e09723a"
          ~ "main_version"         = "0ca4a122c64f37b43518510e62641af2" -> "0610829c0e634ca072d657f4557e894f"
        }
    }

  # module.actions-runner-noble.module.deregistration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "157ef5f2-a6b2-80e9-c896-5535053f52d1" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "0ca4a122c64f37b43518510e62641af2" -> "0610829c0e634ca072d657f4557e894f"
          ~ "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744" -> "c9bc5cebad6b81307c300f8d1e09723a"
        }
      ~ result  = "157ef5f2-a6b2-80e9-c896-5535053f52d1" -> (known after apply)
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_role_policy_attachment.extra["ssm"] will be created
  + resource "aws_iam_role_policy_attachment" "extra" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "actions-runner-noble"
    }

  # module.actions-runner-noble.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "run_every" {
      ~ description         = "Trigger Lambda record_metric_actions-runner-20250505203133193000000009-KWX4No every minute" -> "Trigger Lambda actions-runner-20250505203133193000000009-KWX4No_record_metric every minute"
        id                  = "actions-runner-2025050520313319300000020250505215106304300000002"
        name                = "actions-runner-2025050520313319300000020250505215106304300000002"
        tags                = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "lambda_target" {
      ~ arn            = "arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133193000000009-KWX4No" -> (known after apply)
        id             = "actions-runner-2025050520313319300000020250505215106304300000002-send-to-lambda"
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_log_group.lambda must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda" {
      ~ arn               = "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/record_metric_actions-runner-20250505203133193000000009-KWX4No" -> (known after apply)
      ~ id                = "/aws/lambda/record_metric_actions-runner-20250505203133193000000009-KWX4No" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/record_metric_actions-runner-20250505203133193000000009-KWX4No" -> "/aws/lambda/actions-runner-20250505203133193000000009-KWX4No_record_metric" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (4 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_logging must be replaced
-/+ resource "aws_iam_policy" "lambda_logging" {
      ~ arn              = "arn:aws:iam::303467602807:policy/lambda_logging20250505215106681400000003" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "IAM policy for logging from a lambda record_metric_actions-runner-20250505203133193000000009-KWX4No" -> "IAM policy for logging from a lambda actions-runner-20250505203133193000000009-KWX4No_record_metric" # forces replacement
      ~ id               = "arn:aws:iam::303467602807:policy/lambda_logging20250505215106681400000003" -> (known after apply)
      ~ name             = "lambda_logging20250505215106681400000003" -> (known after apply)
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogStream"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/record_metric_actions-runner-20250505203133193000000009-KWX4No"
                    },
                  - {
                      - Action   = "logs:PutLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id        = "ANPAUNKAUEN3325SCCXHB" -> (known after apply)
        tags             = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (3 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_logs" {
      ~ id         = "infrahouse-registration20250505214308709200000002-20250505215107893600000006" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::303467602807:policy/lambda_logging20250505215106681400000003" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda must be replaced
-/+ resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133193000000009-KWX4No" -> (known after apply)
      ~ code_sha256                    = "eUmA7J6GRsw3CwmrGPs89VJTnXeit/nkoACRXnmwxag=" -> (known after apply)
      ~ function_name                  = "record_metric_actions-runner-20250505203133193000000009-KWX4No" -> "actions-runner-20250505203133193000000009-KWX4No_record_metric" # forces replacement
      ~ id                             = "record_metric_actions-runner-20250505203133193000000009-KWX4No" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133193000000009-KWX4No/invocations" -> (known after apply)
      ~ last_modified                  = "2025-05-05T22:40:04.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133193000000009-KWX4No:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:303467602807:function:record_metric_actions-runner-20250505203133193000000009-KWX4No:$LATEST/invocations" -> (known after apply)
      ~ s3_key                         = "b09706d0-000b-622d-06b1-c7df91a9b57e.zip" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 21151177 -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/record_metric_actions-runner-20250505203133193000000009-KWX4No" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function_event_invoke_config.update_filter must be replaced
-/+ resource "aws_lambda_function_event_invoke_config" "update_filter" {
      ~ function_name                = "record_metric_actions-runner-20250505203133193000000009-KWX4No" -> "actions-runner-20250505203133193000000009-KWX4No_record_metric" # forces replacement
      ~ id                           = "record_metric_actions-runner-20250505203133193000000009-KWX4No" -> (known after apply)
      - maximum_event_age_in_seconds = 0 -> null
        # (2 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge must be replaced
-/+ resource "aws_lambda_permission" "allow_eventbridge" {
      ~ function_name       = "record_metric_actions-runner-20250505203133193000000009-KWX4No" -> "actions-runner-20250505203133193000000009-KWX4No_record_metric" # forces replacement
      ~ id                  = "AllowExecutionFromEventBridge" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/b09706d0-000b-622d-06b1-c7df91a9b57e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "ff4b72cfab5c47f300c9a6c3d78afca4-5" -> (known after apply)
      ~ id                            = "b09706d0-000b-622d-06b1-c7df91a9b57e.zip" -> (known after apply)
      ~ key                           = "b09706d0-000b-622d-06b1-c7df91a9b57e.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/record_metric/b09706d0-000b-622d-06b1-c7df91a9b57e.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4332203672224003711" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744" -> "b27996808eca928c3e27d41ab0ab456d"
          ~ "main_version"         = "38c7850f0e812a275d4d5235aa4bd045" -> "009a1509fd6c7174d1f87bf6bac70353"
        }
    }

  # module.actions-runner-noble.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "b09706d0-000b-622d-06b1-c7df91a9b57e" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "38c7850f0e812a275d4d5235aa4bd045" -> "009a1509fd6c7174d1f87bf6bac70353"
          ~ "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744" -> "b27996808eca928c3e27d41ab0ab456d"
        }
      ~ result  = "b09706d0-000b-622d-06b1-c7df91a9b57e" -> (known after apply)
    }

  # module.actions-runner-noble.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id               = "arn:aws:iam::303467602807:policy/lambda_permissions20250505203140140100000020"
        name             = "lambda_permissions20250505203140140100000020"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "autoscaling:RecordLifecycleActionHeartbeat",
                            "autoscaling:CompleteLifecycleAction",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:*:autoScalingGroupName/actions-runner-20250505203133193000000009-KWX4No"
                    },
                  ~ {
                      ~ Action   = [
                          + "ssm:SendCommand",
                          + "ssm:GetCommandInvocation",
                            "ec2:DescribeTags",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "ec2:CreateTags"
                        Effect   = "Allow"
                        Resource = "arn:aws:ec2:*:303467602807:instance/*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaENIManagementAccess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess"
      + role       = "infrahouse-registration20250505203139737900000019"
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_registration"
      ~ last_modified                  = "2025-05-05T20:31:53.278+0000" -> (known after apply)
      ~ s3_key                         = "08242018-2ecb-5b03-fc52-d9594740f06e.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0bb31d7e35bcabcab",
            ]
          + subnet_ids                  = [
              + "subnet-0a205209260302668",
              + "subnet-0a3a8e5a973c88986",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/08242018-2ecb-5b03-fc52-d9594740f06e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "16c90d93211f09b97f8fd8daea19b0dc-5" -> (known after apply)
      ~ id                            = "08242018-2ecb-5b03-fc52-d9594740f06e.zip" -> (known after apply)
      ~ key                           = "08242018-2ecb-5b03-fc52-d9594740f06e.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/runner_registration/08242018-2ecb-5b03-fc52-d9594740f06e.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "5222180462529707936" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744" -> "c9bc5cebad6b81307c300f8d1e09723a"
          ~ "main_version"         = "95d3cdd170c6143cae4d84604cb4c6e9" -> "f9ec518ccebbfddf2a90c8883410c99b"
        }
    }

  # module.actions-runner-noble.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "08242018-2ecb-5b03-fc52-d9594740f06e" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "95d3cdd170c6143cae4d84604cb4c6e9" -> "f9ec518ccebbfddf2a90c8883410c99b"
          ~ "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744" -> "c9bc5cebad6b81307c300f8d1e09723a"
        }
      ~ result  = "08242018-2ecb-5b03-fc52-d9594740f06e" -> (known after apply)
    }

Plan: 42 to add, 14 to change, 30 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDQyLCAiY2hhbmdlIjogMTQsICJkZXN0cm95IjogMzB9fQ==
```
</details>